[
  {
    "title": "Law.BD",
    "cardTitle": "Law.BD",
    "image": "https://i.ibb.co/Gf72Bb4s/image.png",
    "description": "Built with HTML, Tailwind CSS, and React, Law.BD lets users view detailed profiles of lawyers using React Router. It includes a booking system that shows cost analysis graphs on a separate page. A dedicated blog page is also included.",
    "techStack": ["HTML", "Tailwind CSS", "React", "React Router"],
    "liveLink": "https://assignment-8-akib-dev1.netlify.app/",
    "githubLink": "https://github.com/Akib-dev1/Lawyer.BD",
    "challenges": "Integrating dynamic cost graphs for each lawyer and managing page routing without a backend was challenging.",
    "futurePlans": "Plan to add authentication, user dashboards, and integrate Firebase for lawyer appointment history and real-time chat."
  },
  {
    "title": "PlantPlanet",
    "cardTitle": "PlantPlanet",
    "image": "https://i.ibb.co/vvKXBnVm/image.png",
    "description": "A full-stack, mobile-responsive web application for managing and monitoring indoor and outdoor plant care tasks. Designed with a vibrant Mango-themed aesthetic, this platform allows plant lovers to easily track watering, fertilizing, and overall plant health.",
    "techStack": ["React", "Tailwind CSS", "Node.js", "Express.js", "MongoDB"],
    "liveLink": "https://assignment-10-akib-dev1.netlify.app/",
    "githubLink": "https://github.com/Akib-dev1/assignment-10",
    "challenges": "Handling real-time plant tracking and syncing data between backend and frontend was a major challenge.",
    "futurePlans": "Future plans include adding push notifications for plant care, and AI-based suggestions for plant health."
  },
  {
    "title": "Grand Palace",
    "cardTitle": "Grand Palace",
    "image": "https://i.ibb.co/SwQ4z5tr/image.png",
    "description": "A fully responsive restaurant website built using HTML, Tailwind CSS, and JavaScript — created as a beginner project to practice real-world layout, interactivity, and responsive design.",
    "techStack": ["React", "Tailwind CSS", "Firebase"],
    "liveLink": "https://akib-dev1.github.io/Responsive-Restaurant/",
    "githubLink": "https://github.com/Akib-dev1/Responsive-Restaurant",
    "challenges": "Implementing responsive UI for booking flow and managing state across pages with Firebase authentication.",
    "futurePlans": "Add admin dashboard, payment gateway integration, and multilingual support for international users."
  },
  {
    "title": "Pixelo Merch",
    "cardTitle": "Pixelo Merch",
    "image": "https://i.ibb.co.com/vvwWcdhC/image.png",
    "description": "Pixelo Merch is a full-stack e-commerce platform built with Next.js where users can browse products, add them to a cart, and place cash-on-delivery orders without needing an account. A powerful admin dashboard lets admins manage products, categories, stock, and orders from a single interface.",
    "techStack": [
      "Next.js",
      "Next Auth",
      "React",
      "Next.js API Routes",
      "MongoDB",
      "Mongoose",
      "Tailwind CSS",
      "HTML",
      "CSS",
      "ImgBB API",
      "REST API"
    ],
    "liveLink": "https://pixelo-merch.vercel.app/",
    "githubLink": "",
    "challenges": "Handling full e-commerce flows such as cart, orders, and admin product management without a traditional backend framework and keeping state consistent across pages was challenging.",
    "futurePlans": "Add user authentication, online payments, product wishlists, discount system, and improved analytics in the admin dashboard."
  },
  {
    "title": "Servview",
    "cardTitle": "Servview",
    "image": "https://i.ibb.co.com/WNNj4knV/image.png",
    "description": "Servview is a full-stack service listing platform where users can explore different services, view detailed information, and read or write reviews. It helps users find reliable services with transparent feedback and clear descriptions.",
    "techStack": [
      "React",
      "React Router",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Mongoose",
      "JWT Authentication",
      "Tailwind CSS",
      "HTML",
      "CSS",
      "Axios",
      "REST API"
    ],
    "liveLink": "https://assignment-11-akib-dev1.netlify.app/",
    "githubLink": "",
    "challenges": "Designing the review system and preventing duplicate reviews while keeping the UI responsive was a major challenge.",
    "futurePlans": "Add service owner dashboards, advanced filters, recommendations, and pagination/infinite scroll."
  },
  {
    "title": "GhotokBD",
    "cardTitle": "GhotokBD",
    "image": "https://i.ibb.co.com/mVZdJ3rQ/image.png",
    "description": "GhotokBD is a full-stack matrimony platform where users can browse profiles and request contact details. Users may pay to unlock specific profiles or become premium members for extended access.",
    "techStack": [
      "React",
      "React Router",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Mongoose",
      "JWT Authentication",
      "Tailwind CSS",
      "HTML",
      "CSS",
      "REST API"
    ],
    "liveLink": "https://assignment-12-akib-dev1.netlify.app/",
    "githubLink": "https://github.com/Akib-dev1/Ghotok-BD",
    "challenges": "Building a premium membership system and securing profile access rules required careful backend logic and database design.",
    "futurePlans": "Add advanced matchmaking, search filters, secure payment integration, real-time chat, and admin moderation tools."
  }
]
